src/cfe/КСП/InformationRegisters/ксп_ИсторияИзмененийКоллекцииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ИсторияИзмененийКоллекцииНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_ИсторияИзмененийКоллекцииНоменклатуры/Ext/ManagerModule.bsl
Функция НайтиИсториюКоллекции (Номенклатура, Коллекция) Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ксп_ИсторияИзмененийКоллекцииНоменклатуры.Номенклатура КАК Номенклатура,
	|	ксп_ИсторияИзмененийКоллекцииНоменклатуры.Коллекция КАК Коллекция
	|ИЗ
	|	РегистрСведений.ксп_ИсторияИзмененийКоллекцииНоменклатуры КАК ксп_ИсторияИзмененийКоллекцииНоменклатуры
	|ГДЕ
	|	ксп_ИсторияИзмененийКоллекцииНоменклатуры.Коллекция = &Коллекция
	|	И ксп_ИсторияИзмененийКоллекцииНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Коллекция", Коллекция);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		НЗ = РегистрыСведений.ксп_ИсторияИзмененийКоллекцииНоменклатуры.СоздатьНаборЗаписей();
		НЗ.Отбор.Номенклатура.Установить(Номенклатура);
		НЗ.Отбор.Коллекция.Установить(Коллекция);
		стрк = НЗ.Добавить();
		стрк.Номенклатура = Номенклатура;
		стрк.Коллекция = Коллекция;  
		НЗ.Записать();
		
	КонецЕсли;
	
	
	
КонецФункции
